{
  "courseCode": "CST206",
  "courseName": "OPERATING SYSTEMS",
  "month": "June",
  "questions": [
    {
      "marks": "3",
      "module": "Module-1",
      "question": "Describe the role of bootstrap loader in booting a computer system.",
      "topic": "System Boot Process"
    },
    {
      "marks": "3",
      "module": "Module-1",
      "question": "How is distinction of kernel code from user code achieved at hardware level?",
      "topic": "Operating System Structures"
    },
    {
      "marks": "3",
      "module": "Module-2",
      "question": "How many times will 'Forked' get printed by the below code and justify your answer.\nint main() {\nfork();\nfork();\nprintf(\"Forked\\n\");\nreturn 0;}",
      "topic": "Process Lifecycle Management"
    },
    {
      "marks": "3",
      "module": "Module-2",
      "question": "List and explain the various synchronous and asynchronous methods of message passing in IPC.",
      "topic": "Inter-Process Communication (IPC)"
    },
    {
      "marks": "3",
      "module": "Module-3",
      "question": "What is meant by race condition? Explain with the help of an example.",
      "topic": "Critical Section Problem"
    },
    {
      "marks": "3",
      "module": "Module-3",
      "question": "Explain the two strategies used to recover from a deadlock.",
      "topic": "Deadlock Detection and Recovery"
    },
    {
      "marks": "3",
      "module": "Module-4",
      "question": "Differentiate between compile time and load time address binding.",
      "topic": "Address Spaces"
    },
    {
      "marks": "3",
      "module": "Module-4",
      "question": "Consider a logical address space of 256 pages with a 4-KB page size, mapped onto a physical memory of 64 frames. Find the (i) number of bits in the logical address (ii) number of bits in the physical address (iii) number of bits in the offset part of logical address",
      "topic": "Paging"
    },
    {
      "marks": "3",
      "module": "Module-5",
      "question": "Define seek time, rotational latency and disk bandwidth of disks.",
      "topic": "Disk Structure"
    },
    {
      "marks": "3",
      "module": "Module-5",
      "question": "Explain two level directory structure with the help of a diagram.",
      "topic": "Directory Implementation"
    },
    {
      "marks": "7",
      "module": "Module-1",
      "question": "What is the purpose of a system call? Describe how a system call made by a user application is handled.",
      "topic": "System Calls"
    },
    {
      "marks": "7",
      "module": "Module-1",
      "question": "Explain the micro kernel approach to system design with the help of a diagram. How do user programs and kernel services interact in microkernel architecture?",
      "topic": "Operating System Structures"
    },
    {
      "marks": "12",
      "module": "Module-1",
      "question": "Describe in detail about the various functions of Operating systems.",
      "topic": "Operating System Structures"
    },
    {
      "marks": "2",
      "module": "Module-1",
      "question": "What are the advantages of multiprocessor systems?",
      "topic": "Operating System Structures"
    },
    {
      "marks": "6",
      "module": "Module-2",
      "question": "What is meant by context switching? Illustrate the timeline of context switching between two processes using PCBs with the help of a diagram.",
      "topic": "Process States and PCB"
    },
    {
      "marks": "8",
      "module": "Module-2",
      "question": "Differentiate between the following schedulers. (i) Short-term and long term scheduler (ii) Pre-emptive and non-preemptive scheduler",
      "topic": "Process Scheduling Criteria"
    },
    {
      "marks": "9",
      "module": "Module-2",
      "question": "Assume you have the following jobs shown in the table to execute with one processor. Draw the Gantt chart and calculate the average waiting time and average turnaround time if the system uses the following scheduling algorithms\n(i) Preemptive priority scheduling (ii) Nonpreemtive priority scheduling\n(iii) Non-preemptive Shortest Job first scheduling.\nAssume higher priority is indicated with lower numbers.\n\nProcess | Arrival Time(ms) | CPU Burst Time(ms) | Priority\n--- | --- | --- | ---\nPO | 0 | 4 | 3\nP1 | 2 | 5 | 2\nP2 | 3 | 1 | 1\nP3 | 4 | 3 | 4",
      "topic": "Process Scheduling Algorithms"
    },
    {
      "marks": "5",
      "module": "Module-2",
      "question": "Explain the different states of a process and transition between them with the help of a diagram.",
      "topic": "Process States and PCB"
    },
    {
      "marks": "6",
      "module": "Module-3",
      "question": "What is a critical section? State and explain the conditions to be satisfied by a solution to the critical section problem.",
      "topic": "Critical Section Problem"
    },
    {
      "marks": "8",
      "module": "Module-3",
      "question": "Illustrate how resource allocation graph can be used to (i) detect deadlocks and (ii) avoid deadlocks.",
      "topic": "Resource Allocation Graphs"
    },
    {
      "marks": "5",
      "module": "Module-3",
      "question": "Write the algorithm or pseudocode for solving the Dining-Philosophers problem using semaphores. Is the solution prone to deadlocks or starvation? Discuss.",
      "topic": "Classic Synchronization Problems"
    },
    {
      "marks": "9",
      "module": "Module-3",
      "question": "Given the following snapshot of a system at time T0. \nAllocation:\nA B C D\nP0 0 0 1 2\nP1 1 0 0 0\nP2 1 3 5 4\nP3 0 6 3 2\nP4 0 0 1 4\nMax Required:\nA B C D\nP0 0 0 1 2\nP1 1 7 5 0\nP2 2 3 5 6\nP3 0 6 5 2\nP4 0 6 5 6\nAvailable:\nA B C D\n1 5 2 0\nFind whether the system is in a safe state using Banker's algorithm. If P1 generates a request for (0,4,2,0), can the request be granted immediately?",
      "topic": "Banker's Algorithm"
    },
    {
      "marks": "9",
      "module": "Module-4",
      "question": "Calculate the number of page faults for the following reference string with three page frames, using the following algorithms.\n9, 2, 3, 1, 2, 5, 3, 4, 6, 9, 9, 1, 0, 5, 4, 6, 2, 3, 0, 1\n(i) FIFO (ii) Optimal (iii) LRU",
      "topic": "Page Replacement Algorithms"
    },
    {
      "marks": "5",
      "module": "Module-4",
      "question": "Compare the memory organization schemes of pure paging and pure segmentation with respect to the following issues: (i) External Fragmentation (ii) Internal Fragmentation",
      "topic": "Paging"
    },
    {
      "marks": "6",
      "module": "Module-4",
      "question": "Explain how a process larger than the physical memory can be executed with the help of virtual memory. Describe the concept using demand paging.",
      "topic": "Virtual Memory"
    },
    {
      "marks": "8",
      "module": "Module-4",
      "question": "How does translation look-aside buffer (TLB) help to speed up the page access? Illustrate address translation using TLB.",
      "topic": "Paging"
    },
    {
      "marks": "4",
      "module": "Module-5",
      "question": "List and explain the different access methods for files.",
      "topic": "File Access Methods"
    },
    {
      "marks": "10",
      "module": "Module-5",
      "question": "Describe linked and indexed allocation methods for files with the help of neat diagrams.",
      "topic": "File Allocation Methods"
    },
    {
      "marks": "9",
      "module": "Module-5",
      "question": "Suppose that a disk drive has 200 cylinders numbered from 0 to 199 and the current position of the head is at cylinder 100. For the given disk queue of requests: - 20, 89, 130, 45, 120 and 180, draw the head movement in FCFS, SSTF, CSCAN disk scheduling algorithms and compute the total head movements (in cylinders) in each.",
      "topic": "Disk Scheduling"
    },
    {
      "marks": "5",
      "module": "Module-5",
      "question": "Describe the general scheme of using three classifications of users in connection with file access control with the help of an example.",
      "topic": "File Protection"
    }
  ],
  "scheme": "2019 scheme",
  "year": 2022
}